{"format":"layers-model","generatedBy":"keras v3.14.0","convertedBy":"TensorFlow.js Converter v4.20.0","modelTopology":{"keras_version":"3.14.0","backend":"tensorflow","model_config":{"class_name":"Functional","config":{"name":"functional","trainable":true,"layers":[{"class_name":"InputLayer","config":{"dtype":"float32","sparse":false,"ragged":false,"name":"input_layer_1","optional":false,"batchInputShape":[null,300,300,3]},"name":"input_layer_1","inbound_nodes":[]},{"class_name":"RandomFlip","config":{"name":"random_flip","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"seed":null,"mode":"horizontal","data_format":"channels_last"},"name":"random_flip","inbound_nodes":[[["input_layer_1",0,0,{"training":true}]]]},{"class_name":"RandomRotation","config":{"name":"random_rotation","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"factor":[-0.05,0.05],"data_format":"channels_last","fill_mode":"reflect","fill_value":0.0,"interpolation":"bilinear","seed":null},"name":"random_rotation","inbound_nodes":[[["random_flip",0,0,{"training":true}]]]},{"class_name":"Functional","config":{"name":"efficientnetb3","trainable":true,"layers":[{"class_name":"InputLayer","config":{"dtype":"float32","sparse":false,"ragged":false,"name":"input_layer","optional":false,"batchInputShape":[null,300,300,3]},"name":"input_layer","inbound_nodes":[]},{"class_name":"Rescaling","config":{"name":"rescaling","trainable":false,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"scale":0.00392156862745098,"offset":0.0},"name":"rescaling","inbound_nodes":[[["input_layer",0,0,{}]]]},{"class_name":"Normalization","config":{"name":"normalization","trainable":false,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"axis":[3],"invert":false,"mean":null,"variance":null},"name":"normalization","inbound_nodes":[[["rescaling",0,0,{}]]]},{"class_name":"Rescaling","config":{"name":"rescaling_1","trainable":false,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"scale":[2.0896918976428642,2.1128856368212916,2.1081851067789197],"offset":0.0},"name":"rescaling_1","inbound_nodes":[[["normalization",0,0,{}]]]},{"class_name":"ZeroPadding2D","config":{"name":"stem_conv_pad","trainable":false,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"padding":[[0,1],[0,1]],"data_format":"channels_last"},"name":"stem_conv_pad","inbound_nodes":[[["rescaling_1",0,0,{}]]]},{"class_name":"Conv2D","config":{"name":"stem_conv","trainable":false,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"filters":40,"kernel_size":[3,3],"strides":[2,2],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"groups":1,"activation":"linear","use_bias":false,"kernel_initializer":{"module":"keras.initializers","class_name":"VarianceScaling","config":{"seed":null,"scale":2.0,"mode":"fan_out","distribution":"truncated_normal"},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"name":"stem_conv","inbound_nodes":[[["stem_conv_pad",0,0,{}]]]},{"class_name":"BatchNormalization","config":{"name":"stem_bn","trainable":false,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"axis":3,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"gamma_initializer":{"module":"keras.initializers","class_name":"Ones","config":{},"registered_name":null},"moving_mean_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"moving_variance_initializer":{"module":"keras.initializers","class_name":"Ones","config":{},"registered_name":null},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"synchronized":false,"renorm":false,"renorm_clipping":null,"renorm_momentum":0.99},"name":"stem_bn","inbound_nodes":[[["stem_conv",0,0,{"mask":null}]]]},{"class_name":"Activation","config":{"name":"stem_activation","trainable":false,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"activation":"silu"},"name":"stem_activation","inbound_nodes":[[["stem_bn",0,0,{}]]]},{"class_name":"DepthwiseConv2D","config":{"name":"block1a_dwconv","trainable":false,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"depth_multiplier":1,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"depthwise_initializer":{"module":"keras.initializers","class_name":"VarianceScaling","config":{"seed":null,"scale":2.0,"mode":"fan_out","distribution":"truncated_normal"},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"depthwise_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"depthwise_constraint":null,"bias_constraint":null},"name":"block1a_dwconv","inbound_nodes":[[["stem_activation",0,0,{}]]]},{"class_name":"BatchNormalization","config":{"name":"block1a_bn","trainable":false,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"axis":3,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"gamma_initializer":{"module":"keras.initializers","class_name":"Ones","config":{},"registered_name":null},"moving_mean_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"moving_variance_initializer":{"module":"keras.initializers","class_name":"Ones","config":{},"registered_name":null},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"synchronized":false,"renorm":false,"renorm_clipping":null,"renorm_momentum":0.99},"name":"block1a_bn","inbound_nodes":[[["block1a_dwconv",0,0,{"mask":null}]]]},{"class_name":"Activation","config":{"name":"block1a_activation","trainable":false,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"activation":"silu"},"name":"block1a_activation","inbound_nodes":[[["block1a_bn",0,0,{}]]]},{"class_name":"GlobalAveragePooling2D","config":{"name":"block1a_se_squeeze","trainable":false,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"data_format":"channels_last","keepdims":false},"name":"block1a_se_squeeze","inbound_nodes":[[["block1a_activation",0,0,{}]]]},{"class_name":"Reshape","config":{"name":"block1a_se_reshape","trainable":false,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"target_shape":[1,1,40]},"name":"block1a_se_reshape","inbound_nodes":[[["block1a_se_squeeze",0,0,{}]]]},{"class_name":"Conv2D","config":{"name":"block1a_se_reduce","trainable":false,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"filters":10,"kernel_size":[1,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"groups":1,"activation":"silu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"VarianceScaling","config":{"seed":null,"scale":2.0,"mode":"fan_out","distribution":"truncated_normal"},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"name":"block1a_se_reduce","inbound_nodes":[[["block1a_se_reshape",0,0,{}]]]},{"class_name":"Conv2D","config":{"name":"block1a_se_expand","trainable":false,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"filters":40,"kernel_size":[1,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"groups":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"VarianceScaling","config":{"seed":null,"scale":2.0,"mode":"fan_out","distribution":"truncated_normal"},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"name":"block1a_se_expand","inbound_nodes":[[["block1a_se_reduce",0,0,{}]]]},{"class_name":"Multiply","config":{"name":"block1a_se_excite","trainable":false,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null}},"name":"block1a_se_excite","inbound_nodes":[[["block1a_activation",0,0,{}],["block1a_se_expand",0,0,{}]]]},{"class_name":"Conv2D","config":{"name":"block1a_project_conv","trainable":false,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"filters":24,"kernel_size":[1,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"groups":1,"activation":"linear","use_bias":false,"kernel_initializer":{"module":"keras.initializers","class_name":"VarianceScaling","config":{"seed":null,"scale":2.0,"mode":"fan_out","distribution":"truncated_normal"},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"name":"block1a_project_conv","inbound_nodes":[[["block1a_se_excite",0,0,{}]]]},{"class_name":"BatchNormalization","config":{"name":"block1a_project_bn","trainable":false,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"axis":3,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"gamma_initializer":{"module":"keras.initializers","class_name":"Ones","config":{},"registered_name":null},"moving_mean_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"moving_variance_initializer":{"module":"keras.initializers","class_name":"Ones","config":{},"registered_name":null},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"synchronized":false,"renorm":false,"renorm_clipping":null,"renorm_momentum":0.99},"name":"block1a_project_bn","inbound_nodes":[[["block1a_project_conv",0,0,{"mask":null}]]]},{"class_name":"DepthwiseConv2D","config":{"name":"block1b_dwconv","trainable":false,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"depth_multiplier":1,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"depthwise_initializer":{"module":"keras.initializers","class_name":"VarianceScaling","config":{"seed":null,"scale":2.0,"mode":"fan_out","distribution":"truncated_normal"},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"depthwise_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"depthwise_constraint":null,"bias_constraint":null},"name":"block1b_dwconv","inbound_nodes":[[["block1a_project_bn",0,0,{}]]]},{"class_name":"BatchNormalization","config":{"name":"block1b_bn","trainable":false,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"axis":3,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"gamma_initializer":{"module":"keras.initializers","class_name":"Ones","config":{},"registered_name":null},"moving_mean_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"moving_variance_initializer":{"module":"keras.initializers","class_name":"Ones","config":{},"registered_name":null},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"synchronized":false,"renorm":false,"renorm_clipping":null,"renorm_momentum":0.99},"name":"block1b_bn","inbound_nodes":[[["block1b_dwconv",0,0,{"mask":null}]]]},{"class_name":"Activation","config":{"name":"block1b_activation","trainable":false,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"activation":"silu"},"name":"block1b_activation","inbound_nodes":[[["block1b_bn",0,0,{}]]]},{"class_name":"GlobalAveragePooling2D","config":{"name":"block1b_se_squeeze","trainable":false,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"data_format":"channels_last","keepdims":false},"name":"block1b_se_squeeze","inbound_nodes":[[["block1b_activation",0,0,{}]]]},{"class_name":"Reshape","config":{"name":"block1b_se_reshape","trainable":false,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"target_shape":[1,1,24]},"name":"block1b_se_reshape","inbound_nodes":[[["block1b_se_squeeze",0,0,{}]]]},{"class_name":"Conv2D","config":{"name":"block1b_se_reduce","trainable":false,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"filters":6,"kernel_size":[1,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"groups":1,"activation":"silu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"VarianceScaling","config":{"seed":null,"scale":2.0,"mode":"fan_out","distribution":"truncated_normal"},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"name":"block1b_se_reduce","inbound_nodes":[[["block1b_se_reshape",0,0,{}]]]},{"class_name":"Conv2D","config":{"name":"block1b_se_expand","trainable":false,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"filters":24,"kernel_size":[1,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"groups":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"VarianceScaling","config":{"seed":null,"scale":2.0,"mode":"fan_out","distribution":"truncated_normal"},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"name":"block1b_se_expand","inbound_nodes":[[["block1b_se_reduce",0,0,{}]]]},{"class_name":"Multiply","config":{"name":"block1b_se_excite","trainable":false,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null}},"name":"block1b_se_excite","inbound_nodes":[[["block1b_activation",0,0,{}],["block1b_se_expand",0,0,{}]]]},{"class_name":"Conv2D","config":{"name":"block1b_project_conv","trainable":false,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"filters":24,"kernel_size":[1,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"groups":1,"activation":"linear","use_bias":false,"kernel_initializer":{"module":"keras.initializers","class_name":"VarianceScaling","config":{"seed":null,"scale":2.0,"mode":"fan_out","distribution":"truncated_normal"},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"name":"block1b_project_conv","inbound_nodes":[[["block1b_se_excite",0,0,{}]]]},{"class_name":"BatchNormalization","config":{"name":"block1b_project_bn","trainable":false,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"axis":3,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"gamma_initializer":{"module":"keras.initializers","class_name":"Ones","config":{},"registered_name":null},"moving_mean_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"moving_variance_initializer":{"module":"keras.initializers","class_name":"Ones","config":{},"registered_name":null},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"synchronized":false,"renorm":false,"renorm_clipping":null,"renorm_momentum":0.99},"name":"block1b_project_bn","inbound_nodes":[[["block1b_project_conv",0,0,{"mask":null}]]]},{"class_name":"Dropout","config":{"name":"block1b_drop","trainable":false,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"rate":0.007692307692307693,"seed":null,"noise_shape":[null,1,1,1]},"name":"block1b_drop","inbound_nodes":[[["block1b_project_bn",0,0,{"training":false}]]]},{"class_name":"Add","config":{"name":"block1b_add","trainable":false,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null}},"name":"block1b_add","inbound_nodes":[[["block1b_drop",0,0,{}],["block1a_project_bn",0,0,{}]]]},{"class_name":"Conv2D","config":{"name":"block2a_expand_conv","trainable":false,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"filters":144,"kernel_size":[1,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"groups":1,"activation":"linear","use_bias":false,"kernel_initializer":{"module":"keras.initializers","class_name":"VarianceScaling","config":{"seed":null,"scale":2.0,"mode":"fan_out","distribution":"truncated_normal"},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"name":"block2a_expand_conv","inbound_nodes":[[["block1b_add",0,0,{}]]]},{"class_name":"BatchNormalization","config":{"name":"block2a_expand_bn","trainable":false,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"axis":3,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"gamma_initializer":{"module":"keras.initializers","class_name":"Ones","config":{},"registered_name":null},"moving_mean_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"moving_variance_initializer":{"module":"keras.initializers","class_name":"Ones","config":{},"registered_name":null},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"synchronized":false,"renorm":false,"renorm_clipping":null,"renorm_momentum":0.99},"name":"block2a_expand_bn","inbound_nodes":[[["block2a_expand_conv",0,0,{"mask":null}]]]},{"class_name":"Activation","config":{"name":"block2a_expand_activation","trainable":false,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"activation":"silu"},"name":"block2a_expand_activation","inbound_nodes":[[["block2a_expand_bn",0,0,{}]]]},{"class_name":"ZeroPadding2D","config":{"name":"block2a_dwconv_pad","trainable":false,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"padding":[[0,1],[0,1]],"data_format":"channels_last"},"name":"block2a_dwconv_pad","inbound_nodes":[[["block2a_expand_activation",0,0,{}]]]},{"class_name":"DepthwiseConv2D","config":{"name":"block2a_dwconv","trainable":false,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"depth_multiplier":1,"kernel_size":[3,3],"strides":[2,2],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"depthwise_initializer":{"module":"keras.initializers","class_name":"VarianceScaling","config":{"seed":null,"scale":2.0,"mode":"fan_out","distribution":"truncated_normal"},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"depthwise_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"depthwise_constraint":null,"bias_constraint":null},"name":"block2a_dwconv","inbound_nodes":[[["block2a_dwconv_pad",0,0,{}]]]},{"class_name":"BatchNormalization","config":{"name":"block2a_bn","trainable":false,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"axis":3,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"gamma_initializer":{"module":"keras.initializers","class_name":"Ones","config":{},"registered_name":null},"moving_mean_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"moving_variance_initializer":{"module":"keras.initializers","class_name":"Ones","config":{},"registered_name":null},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"synchronized":false,"renorm":false,"renorm_clipping":null,"renorm_momentum":0.99},"name":"block2a_bn","inbound_nodes":[[["block2a_dwconv",0,0,{"mask":null}]]]},{"class_name":"Activation","config":{"name":"block2a_activation","trainable":false,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"activation":"silu"},"name":"block2a_activation","inbound_nodes":[[["block2a_bn",0,0,{}]]]},{"class_name":"GlobalAveragePooling2D","config":{"name":"block2a_se_squeeze","trainable":false,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"data_format":"channels_last","keepdims":false},"name":"block2a_se_squeeze","inbound_nodes":[[["block2a_activation",0,0,{}]]]},{"class_name":"Reshape","config":{"name":"block2a_se_reshape","trainable":false,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"target_shape":[1,1,144]},"name":"block2a_se_reshape","inbound_nodes":[[["block2a_se_squeeze",0,0,{}]]]},{"class_name":"Conv2D","config":{"name":"block2a_se_reduce","trainable":false,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"filters":6,"kernel_size":[1,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"groups":1,"activation":"silu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"VarianceScaling","config":{"seed":null,"scale":2.0,"mode":"fan_out","distribution":"truncated_normal"},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"name":"block2a_se_reduce","inbound_nodes":[[["block2a_se_reshape",0,0,{}]]]},{"class_name":"Conv2D","config":{"name":"block2a_se_expand","trainable":false,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"filters":144,"kernel_size":[1,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"groups":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"VarianceScaling","config":{"seed":null,"scale":2.0,"mode":"fan_out","distribution":"truncated_normal"},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"name":"block2a_se_expand","inbound_nodes":[[["block2a_se_reduce",0,0,{}]]]},{"class_name":"Multiply","config":{"name":"block2a_se_excite","trainable":false,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null}},"name":"block2a_se_excite","inbound_nodes":[[["block2a_activation",0,0,{}],["block2a_se_expand",0,0,{}]]]},{"class_name":"Conv2D","config":{"name":"block2a_project_conv","trainable":false,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"filters":32,"kernel_size":[1,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"groups":1,"activation":"linear","use_bias":false,"kernel_initializer":{"module":"keras.initializers","class_name":"VarianceScaling","config":{"seed":null,"scale":2.0,"mode":"fan_out","distribution":"truncated_normal"},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"name":"block2a_project_conv","inbound_nodes":[[["block2a_se_excite",0,0,{}]]]},{"class_name":"BatchNormalization","config":{"name":"block2a_project_bn","trainable":false,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"axis":3,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"gamma_initializer":{"module":"keras.initializers","class_name":"Ones","config":{},"registered_name":null},"moving_mean_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"moving_variance_initializer":{"module":"keras.initializers","class_name":"Ones","config":{},"registered_name":null},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"synchronized":false,"renorm":false,"renorm_clipping":null,"renorm_momentum":0.99},"name":"block2a_project_bn","inbound_nodes":[[["block2a_project_conv",0,0,{"mask":null}]]]},{"class_name":"Conv2D","config":{"name":"block2b_expand_conv","trainable":false,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"filters":192,"kernel_size":[1,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"groups":1,"activation":"linear","use_bias":false,"kernel_initializer":{"module":"keras.initializers","class_name":"VarianceScaling","config":{"seed":null,"scale":2.0,"mode":"fan_out","distribution":"truncated_normal"},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"name":"block2b_expand_conv","inbound_nodes":[[["block2a_project_bn",0,0,{}]]]},{"class_name":"BatchNormalization","config":{"name":"block2b_expand_bn","trainable":false,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"axis":3,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"gamma_initializer":{"module":"keras.initializers","class_name":"Ones","config":{},"registered_name":null},"moving_mean_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"moving_variance_initializer":{"module":"keras.initializers","class_name":"Ones","config":{},"registered_name":null},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"synchronized":false,"renorm":false,"renorm_clipping":null,"renorm_momentum":0.99},"name":"block2b_expand_bn","inbound_nodes":[[["block2b_expand_conv",0,0,{"mask":null}]]]},{"class_name":"Activation","config":{"name":"block2b_expand_activation","trainable":false,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"activation":"silu"},"name":"block2b_expand_activation","inbound_nodes":[[["block2b_expand_bn",0,0,{}]]]},{"class_name":"DepthwiseConv2D","config":{"name":"block2b_dwconv","trainable":false,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"depth_multiplier":1,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"depthwise_initializer":{"module":"keras.initializers","class_name":"VarianceScaling","config":{"seed":null,"scale":2.0,"mode":"fan_out","distribution":"truncated_normal"},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"depthwise_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"depthwise_constraint":null,"bias_constraint":null},"name":"block2b_dwconv","inbound_nodes":[[["block2b_expand_activation",0,0,{}]]]},{"class_name":"BatchNormalization","config":{"name":"block2b_bn","trainable":false,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"axis":3,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"gamma_initializer":{"module":"keras.initializers","class_name":"Ones","config":{},"registered_name":null},"moving_mean_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"moving_variance_initializer":{"module":"keras.initializers","class_name":"Ones","config":{},"registered_name":null},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"synchronized":false,"renorm":false,"renorm_clipping":null,"renorm_momentum":0.99},"name":"block2b_bn","inbound_nodes":[[["block2b_dwconv",0,0,{"mask":null}]]]},{"class_name":"Activation","config":{"name":"block2b_activation","trainable":false,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"activation":"silu"},"name":"block2b_activation","inbound_nodes":[[["block2b_bn",0,0,{}]]]},{"class_name":"GlobalAveragePooling2D","config":{"name":"block2b_se_squeeze","trainable":false,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"data_format":"channels_last","keepdims":false},"name":"block2b_se_squeeze","inbound_nodes":[[["block2b_activation",0,0,{}]]]},{"class_name":"Reshape","config":{"name":"block2b_se_reshape","trainable":false,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"target_shape":[1,1,192]},"name":"block2b_se_reshape","inbound_nodes":[[["block2b_se_squeeze",0,0,{}]]]},{"class_name":"Conv2D","config":{"name":"block2b_se_reduce","trainable":false,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"filters":8,"kernel_size":[1,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"groups":1,"activation":"silu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"VarianceScaling","config":{"seed":null,"scale":2.0,"mode":"fan_out","distribution":"truncated_normal"},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"name":"block2b_se_reduce","inbound_nodes":[[["block2b_se_reshape",0,0,{}]]]},{"class_name":"Conv2D","config":{"name":"block2b_se_expand","trainable":false,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"filters":192,"kernel_size":[1,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"groups":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"VarianceScaling","config":{"seed":null,"scale":2.0,"mode":"fan_out","distribution":"truncated_normal"},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"name":"block2b_se_expand","inbound_nodes":[[["block2b_se_reduce",0,0,{}]]]},{"class_name":"Multiply","config":{"name":"block2b_se_excite","trainable":false,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null}},"name":"block2b_se_excite","inbound_nodes":[[["block2b_activation",0,0,{}],["block2b_se_expand",0,0,{}]]]},{"class_name":"Conv2D","config":{"name":"block2b_project_conv","trainable":false,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"filters":32,"kernel_size":[1,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"groups":1,"activation":"linear","use_bias":false,"kernel_initializer":{"module":"keras.initializers","class_name":"VarianceScaling","config":{"seed":null,"scale":2.0,"mode":"fan_out","distribution":"truncated_normal"},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"name":"block2b_project_conv","inbound_nodes":[[["block2b_se_excite",0,0,{}]]]},{"class_name":"BatchNormalization","config":{"name":"block2b_project_bn","trainable":false,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"axis":3,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"gamma_initializer":{"module":"keras.initializers","class_name":"Ones","config":{},"registered_name":null},"moving_mean_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"moving_variance_initializer":{"module":"keras.initializers","class_name":"Ones","config":{},"registered_name":null},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"synchronized":false,"renorm":false,"renorm_clipping":null,"renorm_momentum":0.99},"name":"block2b_project_bn","inbound_nodes":[[["block2b_project_conv",0,0,{"mask":null}]]]},{"class_name":"Dropout","config":{"name":"block2b_drop","trainable":false,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"rate":0.02307692307692308,"seed":null,"noise_shape":[null,1,1,1]},"name":"block2b_drop","inbound_nodes":[[["block2b_project_bn",0,0,{"training":false}]]]},{"class_name":"Add","config":{"name":"block2b_add","trainable":false,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null}},"name":"block2b_add","inbound_nodes":[[["block2b_drop",0,0,{}],["block2a_project_bn",0,0,{}]]]},{"class_name":"Conv2D","config":{"name":"block2c_expand_conv","trainable":false,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"filters":192,"kernel_size":[1,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"groups":1,"activation":"linear","use_bias":false,"kernel_initializer":{"module":"keras.initializers","class_name":"VarianceScaling","config":{"seed":null,"scale":2.0,"mode":"fan_out","distribution":"truncated_normal"},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"name":"block2c_expand_conv","inbound_nodes":[[["block2b_add",0,0,{}]]]},{"class_name":"BatchNormalization","config":{"name":"block2c_expand_bn","trainable":false,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"axis":3,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"gamma_initializer":{"module":"keras.initializers","class_name":"Ones","config":{},"registered_name":null},"moving_mean_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"moving_variance_initializer":{"module":"keras.initializers","class_name":"Ones","config":{},"registered_name":null},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"synchronized":false,"renorm":false,"renorm_clipping":null,"renorm_momentum":0.99},"name":"block2c_expand_bn","inbound_nodes":[[["block2c_expand_conv",0,0,{"mask":null}]]]},{"class_name":"Activation","config":{"name":"block2c_expand_activation","trainable":false,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"activation":"silu"},"name":"block2c_expand_activation","inbound_nodes":[[["block2c_expand_bn",0,0,{}]]]},{"class_name":"DepthwiseConv2D","config":{"name":"block2c_dwconv","trainable":false,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"depth_multiplier":1,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"depthwise_initializer":{"module":"keras.initializers","class_name":"VarianceScaling","config":{"seed":null,"scale":2.0,"mode":"fan_out","distribution":"truncated_normal"},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"depthwise_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"depthwise_constraint":null,"bias_constraint":null},"name":"block2c_dwconv","inbound_nodes":[[["block2c_expand_activation",0,0,{}]]]},{"class_name":"BatchNormalization","config":{"name":"block2c_bn","trainable":false,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"axis":3,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"gamma_initializer":{"module":"keras.initializers","class_name":"Ones","config":{},"registered_name":null},"moving_mean_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"moving_variance_initializer":{"module":"keras.initializers","class_name":"Ones","config":{},"registered_name":null},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"synchronized":false,"renorm":false,"renorm_clipping":null,"renorm_momentum":0.99},"name":"block2c_bn","inbound_nodes":[[["block2c_dwconv",0,0,{"mask":null}]]]},{"class_name":"Activation","config":{"name":"block2c_activation","trainable":false,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"activation":"silu"},"name":"block2c_activation","inbound_nodes":[[["block2c_bn",0,0,{}]]]},{"class_name":"GlobalAveragePooling2D","config":{"name":"block2c_se_squeeze","trainable":false,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"data_format":"channels_last","keepdims":false},"name":"block2c_se_squeeze","inbound_nodes":[[["block2c_activation",0,0,{}]]]},{"class_name":"Reshape","config":{"name":"block2c_se_reshape","trainable":false,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"target_shape":[1,1,192]},"name":"block2c_se_reshape","inbound_nodes":[[["block2c_se_squeeze",0,0,{}]]]},{"class_name":"Conv2D","config":{"name":"block2c_se_reduce","trainable":false,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"filters":8,"kernel_size":[1,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"groups":1,"activation":"silu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"VarianceScaling","config":{"seed":null,"scale":2.0,"mode":"fan_out","distribution":"truncated_normal"},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"name":"block2c_se_reduce","inbound_nodes":[[["block2c_se_reshape",0,0,{}]]]},{"class_name":"Conv2D","config":{"name":"block2c_se_expand","trainable":false,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"filters":192,"kernel_size":[1,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"groups":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"VarianceScaling","config":{"seed":null,"scale":2.0,"mode":"fan_out","distribution":"truncated_normal"},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"name":"block2c_se_expand","inbound_nodes":[[["block2c_se_reduce",0,0,{}]]]},{"class_name":"Multiply","config":{"name":"block2c_se_excite","trainable":false,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null}},"name":"block2c_se_excite","inbound_nodes":[[["block2c_activation",0,0,{}],["block2c_se_expand",0,0,{}]]]},{"class_name":"Conv2D","config":{"name":"block2c_project_conv","trainable":false,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"filters":32,"kernel_size":[1,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"groups":1,"activation":"linear","use_bias":false,"kernel_initializer":{"module":"keras.initializers","class_name":"VarianceScaling","config":{"seed":null,"scale":2.0,"mode":"fan_out","distribution":"truncated_normal"},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"name":"block2c_project_conv","inbound_nodes":[[["block2c_se_excite",0,0,{}]]]},{"class_name":"BatchNormalization","config":{"name":"block2c_project_bn","trainable":false,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"axis":3,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"gamma_initializer":{"module":"keras.initializers","class_name":"Ones","config":{},"registered_name":null},"moving_mean_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"moving_variance_initializer":{"module":"keras.initializers","class_name":"Ones","config":{},"registered_name":null},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"synchronized":false,"renorm":false,"renorm_clipping":null,"renorm_momentum":0.99},"name":"block2c_project_bn","inbound_nodes":[[["block2c_project_conv",0,0,{"mask":null}]]]},{"class_name":"Dropout","config":{"name":"block2c_drop","trainable":false,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"rate":0.03076923076923077,"seed":null,"noise_shape":[null,1,1,1]},"name":"block2c_drop","inbound_nodes":[[["block2c_project_bn",0,0,{"training":false}]]]},{"class_name":"Add","config":{"name":"block2c_add","trainable":false,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null}},"name":"block2c_add","inbound_nodes":[[["block2c_drop",0,0,{}],["block2b_add",0,0,{}]]]},{"class_name":"Conv2D","config":{"name":"block3a_expand_conv","trainable":false,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"filters":192,"kernel_size":[1,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"groups":1,"activation":"linear","use_bias":false,"kernel_initializer":{"module":"keras.initializers","class_name":"VarianceScaling","config":{"seed":null,"scale":2.0,"mode":"fan_out","distribution":"truncated_normal"},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"name":"block3a_expand_conv","inbound_nodes":[[["block2c_add",0,0,{}]]]},{"class_name":"BatchNormalization","config":{"name":"block3a_expand_bn","trainable":false,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"axis":3,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"gamma_initializer":{"module":"keras.initializers","class_name":"Ones","config":{},"registered_name":null},"moving_mean_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"moving_variance_initializer":{"module":"keras.initializers","class_name":"Ones","config":{},"registered_name":null},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"synchronized":false,"renorm":false,"renorm_clipping":null,"renorm_momentum":0.99},"name":"block3a_expand_bn","inbound_nodes":[[["block3a_expand_conv",0,0,{"mask":null}]]]},{"class_name":"Activation","config":{"name":"block3a_expand_activation","trainable":false,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"activation":"silu"},"name":"block3a_expand_activation","inbound_nodes":[[["block3a_expand_bn",0,0,{}]]]},{"class_name":"ZeroPadding2D","config":{"name":"block3a_dwconv_pad","trainable":false,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"padding":[[2,2],[2,2]],"data_format":"channels_last"},"name":"block3a_dwconv_pad","inbound_nodes":[[["block3a_expand_activation",0,0,{}]]]},{"class_name":"DepthwiseConv2D","config":{"name":"block3a_dwconv","trainable":false,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"depth_multiplier":1,"kernel_size":[5,5],"strides":[2,2],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"depthwise_initializer":{"module":"keras.initializers","class_name":"VarianceScaling","config":{"seed":null,"scale":2.0,"mode":"fan_out","distribution":"truncated_normal"},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"depthwise_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"depthwise_constraint":null,"bias_constraint":null},"name":"block3a_dwconv","inbound_nodes":[[["block3a_dwconv_pad",0,0,{}]]]},{"class_name":"BatchNormalization","config":{"name":"block3a_bn","trainable":false,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"axis":3,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"gamma_initializer":{"module":"keras.initializers","class_name":"Ones","config":{},"registered_name":null},"moving_mean_initializer":{"module":"keras.initializers",